#+TITLE: Gcp Auditing
* Gcloud things:
Login to gcloud
#+BEGIN_SRC tmate :window prepare
gcloud auth login
#+END_SRC

Set the project
#+BEGIN_SRC tmate :window prepare
gcloud config set project k8s-infra-ii-sandbox
#+END_SRC

Find sandbox-project-id
#+BEGIN_SRC shell
gcloud projects list | grep k8s-infra-ii-sandbox
#+END_SRC

#+RESULTS:
#+begin_example
k8s-infra-ii-sandbox            k8s-infra-ii-sandbox            631771264409
#+end_example

